print("Выберите тип задания: \n1)кодированиеинформации \n2)кодирование изображения \n3)кодирование звука")
a = int(input("Введите тип задачи: "))
if a==1:
    print =("Какой вид данных нужно узнать? \n1)Мощность алфавита \n2)Разряд кода \n3)Объем информации \n4)Количеств информации")
elif a==2:
    print("Какой вид данных нужно узнать? \n1)Количеств оттенков \n2)Битовая глубина")
elif a==3:
    print("Какой вид данных нужно узнать? \n1)Шаг дискретзации \n2)Частота дискретизации \n3)Битовая глубина \n4)оличество измерений")
